/**
 * # mono data class
 * > O, T, mS, S, mL, L, I : mono
 * >monoの格納配列は4*4の16マスです。
 * >monoは初期値として四隅に固まってます。
 * 
 * @date 2023/7/12 - 23:17:08
 *
 * @class MonoData
 * @typedef {MonoData}
 */
export const MonoData = {
    O_MONO : [
      [1, 1, 0, 0],
      [1, 1, 0, 0],
      [0, 0, 0, 0],
      [0, 0, 0, 0]
    ],
  
    T_MONO : [
      [0, 1, 0, 0],
      [1, 1, 1, 0],
      [0, 0, 0, 0],
      [0, 0, 0, 0]
    ],
  
    S_MONO : [
      [1, 0, 0, 0],
      [1, 1, 0, 0],
      [0, 1, 0, 0],
      [0, 0, 0, 0]
    ],
  
    MIRROR_S_MONO : [
      [0, 1, 0, 0],
      [1, 1, 0, 0],
      [1, 0, 0, 0],
      [0, 0, 0, 0]
    ],
  
    L_MONO : [
      [1, 0, 0, 0],
      [1, 0, 0, 0],
      [1, 1, 0, 0],
      [0, 0, 0, 0]
    ],
  
    MIRROR_L_MONO : [
      [0, 1, 0, 0],
      [0, 1, 0, 0],
      [1, 1, 0, 0],
      [0, 0, 0, 0]
    ],
  
    I_MONO : [
      [1, 0, 0, 0],
      [1, 0, 0, 0],
      [1, 0, 0, 0],
      [1, 0, 0, 0]
    ]
}  